HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxScu_bf.h
/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_OFF (20)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_OFF (0)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.EVR33OVVAL */
#define IFX_SCU_EVROVMON_EVR33OVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.EVR33OVVAL */
#define IFX_SCU_EVROVMON_EVR33OVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.EVR33OVVAL */
#define IFX_SCU_EVROVMON_EVR33OVVAL_OFF (8)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_SCU_EVRRSTCON_BPRST33OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_SCU_EVRRSTCON_BPRST33OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_SCU_EVRRSTCON_BPRST33OFF_OFF (27)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_OFF (29)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.RST33OFF */
#define IFX_SCU_EVRRSTCON_RST33OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.RST33OFF */
#define IFX_SCU_EVRRSTCON_RST33OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.RST33OFF */
#define IFX_SCU_EVRRSTCON_RST33OFF_OFF (26)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_SCU_EVRRSTCON_RSTSWDOFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_SCU_EVRRSTCON_RSTSWDOFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_SCU_EVRRSTCON_RSTSWDOFF_OFF (28)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF1_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF1_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF1_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF1_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF1_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF1_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF1_Bits.SD5D */
#define IFX_SCU_EVRSDCOEFF1_SD5D_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF1_Bits.SD5D */
#define IFX_SCU_EVRSDCOEFF1_SD5D_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF1_Bits.SD5D */
#define IFX_SCU_EVRSDCOEFF1_SD5D_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF1_Bits.SD5I */
#define IFX_SCU_EVRSDCOEFF1_SD5I_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF1_Bits.SD5I */
#define IFX_SCU_EVRSDCOEFF1_SD5I_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF1_Bits.SD5I */
#define IFX_SCU_EVRSDCOEFF1_SD5I_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF1_Bits.SD5P */
#define IFX_SCU_EVRSDCOEFF1_SD5P_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF1_Bits.SD5P */
#define IFX_SCU_EVRSDCOEFF1_SD5P_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF1_Bits.SD5P */
#define IFX_SCU_EVRSDCOEFF1_SD5P_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF2_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF2_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF2_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF2_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF2_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF2_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF2_Bits.SD33D */
#define IFX_SCU_EVRSDCOEFF2_SD33D_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF2_Bits.SD33D */
#define IFX_SCU_EVRSDCOEFF2_SD33D_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF2_Bits.SD33D */
#define IFX_SCU_EVRSDCOEFF2_SD33D_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF2_Bits.SD33I */
#define IFX_SCU_EVRSDCOEFF2_SD33I_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF2_Bits.SD33I */
#define IFX_SCU_EVRSDCOEFF2_SD33I_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF2_Bits.SD33I */
#define IFX_SCU_EVRSDCOEFF2_SD33I_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF2_Bits.SD33P */
#define IFX_SCU_EVRSDCOEFF2_SD33P_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF2_Bits.SD33P */
#define IFX_SCU_EVRSDCOEFF2_SD33P_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF2_Bits.SD33P */
#define IFX_SCU_EVRSDCOEFF2_SD33P_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG0 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG0_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG0 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG0_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG0 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG0_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG1 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG1_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG1 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG1_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG1 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG1_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG2 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG2_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG2 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG2_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG2 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG2_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF3_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF3_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF3_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF3_LCK_MSK (0x1)

