HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF3_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF3_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG3 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG3_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG3 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG3_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG3 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG3_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG4 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG4_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG4 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG4_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG4 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG4_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF4_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF4_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF4_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF4_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF4_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF4_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG0 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG0_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG0 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG0_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG0 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG0_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG1 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG1_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG1 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG1_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG1 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG1_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG2 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG2_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG2 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG2_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG2 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG2_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF5_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF5_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF5_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF5_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF5_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF5_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG3 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG3_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG3 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG3_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG3 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG3_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG4 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG4_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG4 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG4_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG4 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG4_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF6_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF6_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF6_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF6_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF6_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF6_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQ */
#define IFX_SCU_EVRSDCTRL1_SDFREQ_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQ */
#define IFX_SCU_EVRSDCTRL1_SDFREQ_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQ */
#define IFX_SCU_EVRSDCTRL1_SDFREQ_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_LEN (16)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_MSK (0xffff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDSAMPLE */
#define IFX_SCU_EVRSDCTRL1_SDSAMPLE_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDSAMPLE */
#define IFX_SCU_EVRSDCTRL1_SDSAMPLE_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDSAMPLE */
#define IFX_SCU_EVRSDCTRL1_SDSAMPLE_OFF (30)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDSTEP */
#define IFX_SCU_EVRSDCTRL1_SDSTEP_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDSTEP */
#define IFX_SCU_EVRSDCTRL1_SDSTEP_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDSTEP */
#define IFX_SCU_EVRSDCTRL1_SDSTEP_OFF (24)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.DRVN */
#define IFX_SCU_EVRSDCTRL2_DRVN_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.DRVN */
#define IFX_SCU_EVRSDCTRL2_DRVN_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.DRVN */
#define IFX_SCU_EVRSDCTRL2_DRVN_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.DRVP */
#define IFX_SCU_EVRSDCTRL2_DRVP_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.DRVP */
#define IFX_SCU_EVRSDCTRL2_DRVP_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.DRVP */
#define IFX_SCU_EVRSDCTRL2_DRVP_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_LEN (6)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_OFF (24)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.SDMINMAXDC */
#define IFX_SCU_EVRSDCTRL2_SDMINMAXDC_LEN (8)

